XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.5.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>iMX7D_DFP</name>
  <description>NXP i.MX 7Dual Family Device Support and Examples</description>

  <requirements>
    <packages>
      <package vendor="ARM"  name="CMSIS"                  version="5.1.0"/>
      <package vendor="ARM"  name="AMP"                    version="1.0.0"/>
      <package vendor="Keil" name="ARM_Compiler"           version="1.3.0"/>
    </packages>
  </requirements>

  <releases>
    <release version="1.7.8" date="2020-05-18">
	  Added i.MX 7ULP Applications Processor Reference Manual.
      Updated Examples:
      - Terminating app_main thread with osThreadExit() to avoid endless loop.
      - Updated NXP SDK enumerations to avoid out of int range warnings.
    </release>
    <release version="1.7.7" date="2019-04-08">
      Updated Linux_Application_TTY example to use latest Linaro GCC toolchain.
      Corrected iMX7D_M4.h header file.
    </release>
    <release version="1.7.6" date="2018-12-05">
      Corrected language settings of [MCIMX7D-SABRE] Blinky M4 RTX5 AC6 example.
      Corrected Inner Cacheability attributes for Translation Table TTBR0 in MMU config.
    </release>
    <release version="1.7.5" date="2018-11-05">
      Updated scatter file for [MCIMX7D-SABRE] Blinky M4 RTX5 AC6 example.
    </release>
    <release version="1.7.4" date="2018-10-29">
      Removed requirement for CMSIS-FreeRTOS and MDK-Middleware packs.
      Added reference manual for i.MX7D.
    </release>
    <release version="1.7.3" date="2018-06-04">
      Updated device support for i.MX 7ULP sub-family silicon revision B.
    </release>
    <release version="1.7.2" date="2018-01-08">
      Updated RPMSG shared buffer address for i.MX7D Meerkat 96 Boards.
    </release>
    <release version="1.7.1" date="2017-10-02">
      Updated board support for i.MX7D Meerkat 96 Boards.
      Updated DebugCoreStart debug access sequence to program an infinite loop for the M4
      so it can execute immediately after being released from reset.
    </release>
    <release version="1.7.0" date="2017-08-11">
      Added CMSIS-RTOS2 RTX5 examples for Cortex-A7 processor.
    </release>
    <release version="1.6.1" date="2017-07-20">
      Updated SVD files to latest version available from NXP correcting some defects.
    </release>  
    <release version="1.6.0" date="2017-07-17">
      Added device support for i.MX 7ULP sub-family.
      Added Cortex-A7 Startup component.
      Added UDP-TCP Socket over RPMSG example.
      Updated RPMSG examples. 
      Updated source files for ARM Compiler 6 support.
      Updated SVD files.
      Note: Toradex RPMSG examples are compatible only with Colibri-VF_LXDE-Image_2.7b3-20170630 or newer Linux releases.
    </release>
    <release version="1.5.1" date="2017-04-13">
      Updated example for MCIMX7D-SABRE board: Frequency Bin.
    </release>
    <release version="1.5.0" date="2017-04-13">
      Added devices into iMX7Solo and iMX7Dual sub-families.
      Added board support for NOVPEK-iMX7.
    </release>
    <release version="1.4.1" date="2016-12-07">
      Added QSPI flash programming algorithm.
      Updated device header files' #pragma push/pop statements to support ARMClang 6.
      Updated SDF file for iMX7Solo to block reset capability.
    </release>
    <release version="1.4.0" date="2016-11-23">
      Added board support for Embedded Artists iMX7 Dual COM.
    </release>
    <release version="1.3.0" date="2016-10-24">
      Added support for i.MX 7Solo devices.
    </release>
    <release version="1.2.0" date="2016-10-17">
      Added board support for Toradex Colibri iMX7.
    </release>
    <release version="1.1.0" date="2016-08-24">
      Added Phytec phyBOARD-i.MX7 Zeta board description and examples.
    </release>
    <release version="1.0.0" date="2016-07-22">
      Initial release of the device family pack for the i.MX7 dual device
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>iMX7</keyword>
    <keyword>iMX7D</keyword>
    <keyword>iMX7S</keyword>
    <keyword>iMX7ULP</keyword>
    <keyword>i.MX7</keyword>
    <keyword>i.MX7D</keyword>
    <keyword>i.MX7S</keyword>
    <keyword>i.MX7ULP</keyword>
  </keywords>

  <devices>
    <family Dfamily="i.MX 7 Series" Dvendor="NXP:11">
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>
      <subFamily DsubFamily="i.MX 7Dual">
        
        <!-- ******************************  i.MX 7Dual  ****************************** -->

        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A7" Punits="2" Dclock="1200000000"/>  <!-- Based on MP020-MS-28610-r0p5-00rel0 -->
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4" Dclock="200000000"/>

        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/iMX7D.sdf"/>

        <!--algorithm name="Flash/MCIMX7_QSPI1A_32.FLM" start="0x60000000"  size="0x02000000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/-->

        <description>
          The i.MX 7Dual family of processors features an advanced implementation of the Arm Cortex-A7 core, which operates at speeds of up to 1.2 GHz, as well as the Arm Cortex-M4 core
          - Heterogeneous Multicore Processing Architecture, up to Dual Cortex-A7 and Cortex-M4 configuration
          - External Memory Support: DDR3/DDR3L/LPDDR2/LPDDR3
          - Flash Memory Support: NAND (60-bit ECC), Managed NAND (eMMC, eSD)
          - Eletrophoretic Display (EPD) Controller
          - Dual Gigabit ETH controllers supporting AVB
          - Parallel RGB and MIPI DSI Display Interfaces
          - Parallel and MIPI CSI Camera Interfaces
          - 256KB SRAM
          - Quad SPI
          - Communication Ports (I2C, SAI, UART, SPI, SDIO, USB, PCIe)
        </description>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/IMX7DRM.pdf" title="i.MX 7Dual Applications Processor Reference Manual"/>

        <feature type="Memory" n="262144" name="SRAM"/>
        <feature type="Memory" n="524288" name="L2 Cache"/>

