XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
        <!-- Cortex-A7: AP 1 for CoreSight access, AP 0 for system AHB access -->
        <debug   Pname="Cortex-A7" Punit="0" __dp="0" __ap="1" address="0x80070000"/>
        <debug   Pname="Cortex-A7" Punit="1" __dp="0" __ap="1" address="0x80072000"/>
        <!-- Cortex-M4: AP 4 for AHB-AP access -->
        <debug   Pname="Cortex-M4"           __dp="0" __ap="4" address="0xE000ED00"/>
        <!-- MDM-AP is AP 3 -->
       
        <compile Pname="Cortex-M4" header="Device/Include/iMX7D_M4.h"  define="iMX7D_M4"/>
        <compile Pname="Cortex-A7" header="Device/Include/iMX7D_A7.h"  define="iMX7D_A7"/>
        <memory  Pname="Cortex-M4" id="IROM1" start="0x00000000" size="0x00008000" startup="1" default="1"/> <!-- CM4 ALIAS CODE -->
        <memory  Pname="Cortex-M4" id="IRAM1" start="0x20000000" size="0x00008000" init   ="0" default="1"/> <!-- TCMU (SRAM_U) -->
        <memory  Pname="Cortex-M4" id="IRAM2" start="0x1FFF0000" size="0x00008000" init   ="0" default="0"/> <!-- TCML (SRAM_L) -->

        <debugvars Pname="Cortex-M4" configfile="Debug/iMX7D_M4.dbgconf">
          __var ReleaseM4 = 0x00000001;   // Enable &amp; Release Cortex-M4 from Reset
        </debugvars>

        <sequences>
          <sequence name="DebugCoreStart" Pname="Cortex-M4">
            <block>
              __var DHCSR_Addr = 0xE000EDF0;
              __var A7_AHB_CSW = 0x43000002;
              __var value = 0;
            </block>
            <control if="__ap == 4 &amp;&amp; ReleaseM4" info="Debugger releases M4 from reset during target connection.">
              <block>
                __ap = 0;                        // Switch to System AHB AP (M4 AP not usable yet)

                WriteAP(0x4,  0x00000000);       // Init Cortex-A7 AP

                // Program an infinite loop so the M4 has something to execute after reset
                Write32(0x00180000, 0x20000000);
                Write32(0x00180004, 0x00000009);
                Write32(0x00180008, 0xE7FEE7FE);

                // SRC: Enable M4
                WriteAP(0x00, A7_AHB_CSW);       // CSW
                WriteAP(0x04, 0x3039000C);       // TAR
                value = ReadAP(0x0C);            // DRW

                value &amp;= ~0x00000001;        // Deassert Non-Self-Clearing M4 Reset
                value     |=  0x00000058;        // Mask WDOG3 RST, Enable M4

                WriteAP(0x00, A7_AHB_CSW);       // CSW
                WriteAP(0x04, 0x3039000C);       // TAR
                WriteAP(0x0C, value);            // DRW
                __ap = 4;                        // Switch back to Cortex-M4 AP
              </block>
            </control>
            <block>
              // Enable Core Debug via DHCSR
              Write32(DHCSR_Addr, 0xA05F0001);
            </block>
          </sequence>

          <sequence name="DebugCoreStart" Pname="Cortex-A7"/>

          <sequence name="ResetSystem" Pname="Cortex-M4">
            <block>
              __var value = 0x00000000;

              // Write SRC_M4RCR[SW_M4P_RST|SW_M4C_RST] (Self-Clearing M4 Core + Platform Reset)
              value  = Read32(0x3039000C);
              value |= 0x00000006;
              Write32(0x3039000C, value);
            </block>
            <control while="Read32(0x3039000C) &amp; 0x00000006" timeout="1000000" info="Wait for Self-Clearing M4 Core + Platform Reset to finish"/>
          </sequence>
        </sequences>

        <device Dname="MCIMX7D2">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7D2_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7D2_M4.svd"/>
        </device>
        <device Dname="MCIMX7D3"> 
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7D3_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7D3_M4.svd"/>
        </device>
        <device Dname="MCIMX7D5">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7D5_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7D5_M4.svd"/>
        </device>
        <device Dname="MCIMX7D7">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7D7_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7D7_M4.svd"/>
        </device>
        
      </subFamily>
      
      <subFamily DsubFamily="i.MX 7Solo">

        <!-- ******************************  i.MX 7Solo  ****************************** -->

        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A7" Dclock="800000000"/>
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4" Dclock="200000000"/>

        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/iMX7.sdf"/>

        <description>
          The i.MX 7Solo family of processors represents our latest achievement in high-performance processing for low-power requirements with a high degree of functional integration
          - Heterogeneous Multicore Processing Architecture, up to Dual Cortex-A7 and Cortex-M4 configuration
          - External Memory Support: DDR3/DDR3L/LPDDR2/LPDDR3
          - Flash Memory Support: NAND (60-bit ECC), Managed NAND (eMMC, eSD)
          - Single Gigabit ETH controllers supporting AVB
          - Parallel RGB and MIPI DSI Display Interfaces
          - Parallel and MIPI CSI Camera Interfaces
          - 256KB SRAM
          - Quad SPI
          - Communication Ports (I2C, SAI, UART, SPI, SDIO, USB)
        </description>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/IMX7SRM.pdf" title="i.MX 7Solo Applications Processor Reference Manual"/>

        <feature type="Memory" n="262144" name="SRAM"/>
        <feature type="Memory" n="524288" name="L2 Cache"/>

        <!-- Cortex-A7: AP 1 for CoreSight access, AP 0 for system AHB access -->
        <debug   Pname="Cortex-A7" __dp="0" __ap="1" address="0x80070000"/>
        <!-- Cortex-M4: AP 4 for AHB-AP access -->
        <debug   Pname="Cortex-M4" __dp="0" __ap="4" address="0xE000ED00"/>
        <!-- MDM-AP is AP 3 -->

        <compile Pname="Cortex-M4" header="Device/Include/iMX7D_M4.h"  define="iMX7D_M4"/>
        <memory  Pname="Cortex-M4" id="IROM1" start="0x00000000" size="0x00008000" startup="1" default="1"/> <!-- CM4 ALIAS CODE -->
        <memory  Pname="Cortex-M4" id="IRAM1" start="0x20000000" size="0x00008000" init   ="0" default="1"/> <!-- TCMU (SRAM_U) -->
        <memory  Pname="Cortex-M4" id="IRAM2" start="0x1FFF0000" size="0x00008000" init   ="0" default="0"/> <!-- TCML (SRAM_L) -->

