XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
        <debugvars Pname="Cortex-M4" configfile="Debug/iMX7D_M4.dbgconf">
          __var ReleaseM4 = 0x00000001;   // Enable &amp; Release Cortex-M4 from Reset
        </debugvars>

        <sequences>
          <sequence name="DebugCoreStart" Pname="Cortex-M4">
            <block>
              __var DHCSR_Addr = 0xE000EDF0;
              __var A7_AHB_CSW = 0x43000002;
              __var value = 0;
            </block>
            <control if="__ap == 4 &amp;&amp; ReleaseM4" info="Debugger releases M4 from reset during target connection.">
              <block>
                __ap = 0;                        // Switch to System AHB AP (M4 AP not usable yet)
        
                WriteAP(0x4,  0x00000000);       // Init Cortex-A7 AP

                // Program an infinite loop so the M4 has something to execute after reset
                Write32(0x00180000, 0x20000000);
                Write32(0x00180004, 0x00000009);
                Write32(0x00180008, 0xE7FEE7FE);

                // SRC: Enable M4
                WriteAP(0x00, A7_AHB_CSW);       // CSW
                WriteAP(0x04, 0x3039000C);       // TAR
                value = ReadAP(0x0C);            // DRW

                value &amp;= ~0x00000001;        // Deassert Non-Self-Clearing M4 Reset
                value     |=  0x00000058;        // Mask WDOG3 RST, Enable M4

                WriteAP(0x00, A7_AHB_CSW);       // CSW
                WriteAP(0x04, 0x3039000C);       // TAR
                WriteAP(0x0C, value);            // DRW
                __ap = 4;                        // Switch back to Cortex-M4 AP
              </block>
            </control>
            <block>
              // Enable Core Debug via DHCSR
              Write32(DHCSR_Addr, 0xA05F0001);
            </block>
          </sequence>

          <sequence name="DebugCoreStart" Pname="Cortex-A7"/>

          <sequence name="ResetSystem" Pname="Cortex-M4">
            <block>
              __var value = 0x00000000;

              // Write SRC_M4RCR[SW_M4P_RST|SW_M4C_RST] (Self-Clearing M4 Core + Platform Reset)
              value  = Read32(0x3039000C);
              value |= 0x00000006;
              Write32(0x3039000C, value);
            </block>
            <control while="Read32(0x3039000C) &amp; 0x00000006" timeout="1000000" info="Wait for Self-Clearing M4 Core + Platform Reset to finish"/>
          </sequence>
        </sequences>
        
        <device Dname="MCIMX7S3">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7S3_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7S3_M4.svd"/>
        </device>
        <device Dname="MCIMX7S5">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7S5_A7.svd"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7S5_M4.svd"/>
        </device>
        
      </subFamily>

      <subFamily DsubFamily="i.MX 7ULP">

        <!-- ******************************  i.MX 7ULP early release for beta testing  ****************************** -->
        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A7" Dclock="800000000"/>
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4" Dclock="200000000"/>

        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/iMX7ULP.sdf"/>

        <description>
          The i.MX 7ULP family of processors represents NXP’s latest achievement in ultra low power processing for use cases demanding long battery life.
          - Heterogeneous Multicore Processing Architecture, Cortex-A7 and Cortex-M4 configuration
          - 2D and 3D Graphics Processing Units (GPU)
          - External Memory Support: LPDDR2/LPDDR3
          - Flash Memory Support: Managed NAND (eMMC, eSD)
          - MIPI DSI Display Interface
          - Parallel Camera Interface
          - 512KB of total SRAM
          - Quad SPI (w/ On The Fly Decryption)
          - Communication Ports (I2C, SAI, UART, SPI, SDIO, USB)
        </description>
        
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/IMX7ULPRM.pdf" title="i.MX 7ULP Applications Processor Reference Manual"/>

        <feature type="Memory" n="524288" name="SRAM"/>
        <feature type="Memory" n="262144" name="L2 Cache"/>

        <memory  Pname="Cortex-M4" id="IROM1" start="0x1FFD2000" size="0x0002E000" startup="1" default="1"/>
        <memory  Pname="Cortex-M4" id="IRAM1" start="0x20000000" size="0x00008000" init   ="0" default="1"/>

        <device Dname="MCIMX7U3">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7U3_A7.svd" __dp="0" __ap="1" address="0x80070000"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7U3_M4.svd" __dp="0" __ap="3" address="0xE000ED00"/>
          <compile Pname="Cortex-M4" header="Device/Include/MCIMX7U3_M4.h"  define="iMX7D_M4"/>
        </device>
        
        <device Dname="MCIMX7U5">
          <debug   Pname="Cortex-A7" svd="SVD/MCIMX7U5_A7.svd" __dp="0" __ap="1" address="0x80070000"/>
          <debug   Pname="Cortex-M4" svd="SVD/MCIMX7U5_M4.svd" __dp="0" __ap="3" address="0xE000ED00"/>
          <compile Pname="Cortex-M4" header="Device/Include/MCIMX7U5_M4.h"  define="iMX7D_M4"/>
        </device>
        
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="ARMCC6">
      <accept Tcompiler="ARMCC" Toptions="AC6"/>
      <accept Tcompiler="ARMCC" Toptions="AC6LTO"/>
    </condition>
    <condition id="ARMCC5">
      <require Tcompiler="ARMCC" Toptions="AC5"/>
    </condition>

    <!-- Device + Core + CMSIS Conditions -->
    <condition id="iMX7D M4 CMSIS">
      <description>NXP iMX7D M4 devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MCIMX7D*"/>
      <accept  Dname="MCIMX7S*"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <condition id="iMX7D A7 CMSIS">
      <description>NXP iMX7D A7 devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MCIMX7D*"/>
      <accept  Dname="MCIMX7S*"/>
      <require Dcore="Cortex-A7"/>
    </condition>

    <!-- Device + Core + CMSIS + HW Initialization -->
    <condition id="iMX7D M4 CMSIS HW">
      <description>NXP iMX7D CM4 devices, CMSIS-CORE and HW INIT</description>
      <require condition="iMX7D M4 CMSIS"/>
      <require Cclass="Board Support" Cgroup="HW INIT"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="iMX7D HAL" Csub="CCM"/>
      <require Cclass="Device" Cgroup="iMX7D HAL" Csub="RDC"/>
    </condition>

    <condition id="iMX7D M4 CMSIS HW GPIO">
      <description>NXP iMX7D CM4 devices, CMSIS-CORE, HW INIT and GPIO</description>
      <require condition="iMX7D M4 CMSIS HW"/>
      <require Cclass="Device" Cgroup="iMX7D HAL" Csub="GPIO"/>
    </condition>

    <condition id="iMX7D M4 CMSIS HW UART">
      <description>NXP iMX7D CM4 devices, CMSIS-CORE, HW INIT and UART</description>
      <require condition="iMX7D M4 CMSIS HW"/>
      <require Cclass="Device" Cgroup="iMX7D HAL" Csub="UART"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="MCIMX7U3">
      <require Dname="MCIMX7U3"/>
    </condition>
    <condition id="MCIMX7U5">
      <require Dname="MCIMX7U5"/>
    </condition>
    <condition id="MCIMX7U3 ARMCC5">
      <require Dname="MCIMX7U3"/>
      <require condition="ARMCC5"/>
    </condition>
