XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <condition id="MCIMX7U5 ARMCC5">
      <require Dname="MCIMX7U5"/>
      <require condition="ARMCC5"/>
    </condition>

    <!-- Device + Core + CMSIS Conditions -->
    <condition id="iMX7ULP M4 CMSIS">
      <description>NXP iMX7ULP devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MCIMX7U*"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <!-- Device + Core + CMSIS + HW Initialization -->
    <condition id="iMX7ULP M4 CMSIS HW">
      <description>NXP iMX7ULP devices, CMSIS-CORE and HW INIT</description>
      <require condition="iMX7ULP M4 CMSIS"/>
      <accept Cclass="Board Support" Cgroup="HW INIT"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="iMX7ULP HAL" Csub="Clock"/>
      <require Cclass="Device" Cgroup="iMX7ULP HAL" Csub="MSMC"/>
    </condition>

    <!-- Device + Core + CMSIS + HW Initialization + DMA-->
    <condition id="iMX7ULP M4 CMSIS HW DMA">
      <description>NXP iMX7ULP devices, CMSIS-CORE, HW INIT and DMA</description>
      <require condition="iMX7ULP M4 CMSIS HW"/>
      <require Cclass="Device" Cgroup="iMX7ULP HAL" Csub="DMA"/>
    </condition>

    <!-- Device + Core + CMSIS Driver USART -->
    <condition id="iMX7ULP M4 CMSIS Driver USART">
      <description>NXP iMX7ULP CMSIS-Driver USART</description>
      <require condition="iMX7ULP M4 CMSIS HW"/>
      <require Cclass="Device" Cgroup="iMX7ULP HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="iMX7ULP HAL" Csub="GPIO"/>
    </condition>

  </conditions>

  <components>
    <!-- Startup iMX7D-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>NXP iMX7D CM4 devices</description>
      <files>   
        <file category="source"       name="Device/Source/AC5/startup_iMX7D_M4.s" version="1.0.0" attr="config" condition="ARMCC5"/>
        <file category="source"       name="Device/Source/AC6/startup_iMX7D_M4.s" version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="source"       name="Device/Source/system_iMX7D_M4.c"      version="1.0.0" attr="config"/>
        <file category="header"       name="Device/Include/system_iMX7D_M4.h"     version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Startup iMX7D-A7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="iMX7D A7 CMSIS">
      <description>NXP iMX7D CA7 devices</description>
      <files>
        <file category="sourceC"      name="Device/Source/AC5/startup_iMX7D_A7.c" version="1.0.0" attr="config" condition="ARMCC5"/>
        <file category="linkerScript" name="Device/Source/AC5/iMX7D_A7.sct"       version="1.0.0" attr="config" condition="ARMCC5"/>
        <file category="sourceC"      name="Device/Source/AC6/startup_iMX7D_A7.c" version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/Source/AC6/iMX7D_A7.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>        
        <file category="sourceC"      name="Device/Source/system_iMX7D_A7.c"      version="1.0.0" attr="config"/>
        <file category="sourceC"      name="Device/Source/mmu_iMX7D_A7.c"         version="1.1.0" attr="config"/>
        <file category="header"       name="Device/Include/system_iMX7D_A7.h"     version="1.0.0" attr="config"/>
        <file category="header"       name="Device/Include/mem_iMX7D_A7.h"        version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Startup iMX7ULP-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS">
      <description>NXP iMX7ULP CM4 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/AC5/startup_MCIMX7U3_M4.s" attr="config" version="1.0.0" condition="MCIMX7U3 ARMCC5"/>
        <file category="source"  name="Device/Source/system_MCIMX7U3_M4.c"      attr="config" version="1.0.0" condition="MCIMX7U3"       />
        <file category="header"  name="Device/Include/system_MCIMX7U3_M4.h"     attr="config" version="1.0.0" condition="MCIMX7U3"       />
        <file category="source"  name="Device/Source/AC5/startup_MCIMX7U5_M4.s" attr="config" version="1.0.0" condition="MCIMX7U5 ARMCC5"/>
        <file category="source"  name="Device/Source/system_MCIMX7U5_M4.c"      attr="config" version="1.0.0" condition="MCIMX7U5"       />
        <file category="header"  name="Device/Include/system_MCIMX7U5_M4.h"     attr="config" version="1.0.0" condition="MCIMX7U5"       />
      </files>
    </component>

    <!-- Board Support -->
    <bundle Cbundle="MCIMX7D-SABRE" Cclass="Board Support" Cversion="1.0.0">
      <description>iMX7D SABRE Board</description>
      <doc></doc>
      <component Cgroup="User I/O Redirect" condition="iMX7D M4 CMSIS HW UART">
        <description>User I/O Redirect to UART</description>
        <files>
          <file category="header" name="Common/retarget_io_user.h"/>
          <file category="source" name="Common/retarget_io_user.c"/>
        </files>
      </component>
      
      <component Cgroup="HW INIT" condition="iMX7D M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/imx7d_sdb_m4/board.c"/>
          <file category="header" name="SDK/examples/imx7d_sdb_m4/board.h"/>
          <file category="source" name="SDK/examples/imx7d_sdb_m4/clock_freq.c"/>
          <file category="header" name="SDK/examples/imx7d_sdb_m4/clock_freq.h"/>
          <file category="source" name="SDK/examples/imx7d_sdb_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/imx7d_sdb_m4/pin_mux.h"/>
        </files>
      </component>
    </bundle>
    
    <bundle Cbundle="MCIMX7ULP-EVK" Cclass="Board Support" Cversion="1.0.0">
      <description>iMXULP EVK Board</description>
      <doc></doc>
      <component Cgroup="HW INIT" condition="iMX7ULP M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/evkmcimx7ulp_m4/board.c"/>
          <file category="header" name="SDK/examples/evkmcimx7ulp_m4/board.h"/>
          <file category="source" name="SDK/examples/evkmcimx7ulp_m4/clock_config.c"/>
          <file category="header" name="SDK/examples/evkmcimx7ulp_m4/clock_config.h"/>
          <file category="source" name="SDK/examples/evkmcimx7ulp_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/evkmcimx7ulp_m4/pin_mux.h"/>
          <file category="header" name="SDK/examples/evkmcimx7ulp_m4/fsl_iomuxc.h"/>
          <file category="header" name="RTE_Driver/Config/RTE_Device.h" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
    
    <bundle Cbundle="Colibri-iMX7" Cclass="Board Support" Cversion="1.0.0">
      <description>Colibri iMX7 Board</description>
      <doc></doc>
      <component Cgroup="User I/O Redirect" condition="iMX7D M4 CMSIS HW UART">
        <description>User I/O Redirect to UART</description>
        <files>
          <file category="header" name="Common/retarget_io_user.h"/>
          <file category="source" name="Common/retarget_io_user.c"/>
        </files>
      </component>

      <component Cgroup="HW INIT" condition="iMX7D M4 CMSIS HW GPIO">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/colibri_imx7_m4/board.c"/>
          <file category="header" name="SDK/examples/colibri_imx7_m4/board.h"/>
          <file category="source" name="SDK/examples/colibri_imx7_m4/clock_freq.c"/>
          <file category="header" name="SDK/examples/colibri_imx7_m4/clock_freq.h"/>
          <file category="source" name="SDK/examples/colibri_imx7_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/colibri_imx7_m4/pin_mux.h"/>
          <file category="source" name="SDK/examples/colibri_imx7_m4/gpio_ctrl.c"/>
          <file category="header" name="SDK/examples/colibri_imx7_m4/gpio_ctrl.h"/>
          <file category="source" name="SDK/examples/colibri_imx7_m4/gpio_pins.c"/>
          <file category="header" name="SDK/examples/colibri_imx7_m4/gpio_pins.h"/>
        </files>
      </component>
    </bundle>
    
    <bundle Cbundle="iMX7-Meerkat-96Boards" Cclass="Board Support" Cversion="1.0.0">
      <description>iMX7 Meerkat 96Boards</description>
      <doc></doc>
      <component Cgroup="HW INIT" condition="iMX7D M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/meerkat96_imx7d_m4/board.c"/>
          <file category="header" name="SDK/examples/meerkat96_imx7d_m4/board.h"/>
        </files>
      </component>

      <component Cgroup="LED" Capiversion="1.00" condition="iMX7D M4 CMSIS HW">
        <description>LED driver</description>
        <files>
          <file category="source" name="Boards/Novtech/iMX7-Meerkat-96Boards/Common/LED_iMX7-Meerkat-96Boards.c"/>
        </files>
      </component>
    </bundle>
    
    <!-- iMX7D HAL Drivers -->
    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="UART" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>Universal Asynchronous Receiver/Transmitter</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/uart_imx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/uart_imx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="MU" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>Messaging Unit</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/mu_imx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/mu_imx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="GPIO" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>General Purpose Input/Output</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/gpio_imx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/gpio_imx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="CCM" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>Clock Control Module</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/ccm_imx7d.c"/>
        <file category="source"  name="SDK/platform/drivers/src/ccm_analog_imx7d.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/ccm_imx7d.h"/>
        <file category="header"  name="SDK/platform/drivers/inc/ccm_analog_imx7d.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="RDC" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>Resource Domain Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/rdc.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/rdc.h"/>
        <file category="source"  name="SDK/platform/drivers/src/rdc_semaphore.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/rdc_semaphore.h"/>
      </files>
    </component>

