XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <component Cclass="Device" Cgroup="iMX7D HAL" Csub="ADC" Cversion="1.0.0" condition="iMX7D M4 CMSIS">
      <description>Analog to Digital Converter</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/adc_imx7d.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/adc_imx7d.h"/>
      </files>
    </component>
  
    <!-- iMX7ULP HAL Drivers -->   
    <component Cclass="Device" Cgroup="iMX7ULP HAL" Csub="Clock" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS">
      <description>Multicore System Mode Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/fsl_clock.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_clock.h"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="iMX7ULP HAL" Csub="MSMC" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS">
      <description>Multicore System Mode Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/fsl_msmc.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_msmc.h"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="iMX7ULP HAL" Csub="DMA" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS">
      <description>Direct Memory Access Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/fsl_edma.c"/>
        <file category="source"  name="SDK/platform/drivers/src/fsl_dmamux.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_edma.h"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_dmamux.h"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="iMX7ULP HAL" Csub="GPIO" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS">
      <description>General Purpose Input/Output</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/fsl_gpio.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_gpio.h"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="iMX7ULP HAL" Csub="UART" Cversion="1.0.0" condition="iMX7ULP M4 CMSIS HW DMA">
      <description>Universal Asynchronous Receiver/Transmitter</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/fsl_lpuart.c"/>
        <file category="source"  name="SDK/platform/drivers/src/fsl_lpuart_edma.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_lpuart.h"/>
        <file category="header"  name="SDK/platform/drivers/inc/fsl_lpuart_edma.h"/>
      </files>
    </component>
    
    <!-- CMSIS Peripherals Drivers -->
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="1.0" condition="iMX7ULP M4 CMSIS Driver USART">
      <description>USART Driver for iMX7ULP</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/fsl_lpuart_cmsis.c"/>
        <file category="header" name="RTE_Driver/fsl_lpuart_cmsis.h"/>
      </files>
    </component>

  </components>

  <!-- Boards description -->
  <boards>
    <board name="MCIMX7D-SABRE" vendor="NXP" revision="Rev B" orderForm="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-7dual-applications-processors:RDIMX7DSABREBRD">
      <description>Development board for iMX7D Application Processors.</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D*"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7S*"/>
      <image small="Images/MCIMX7SABRE_small.jpg" large="Images/MCIMX7SABRE_large.jpg"/>
      <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch)"/>
      <book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-7dual-applications-processors:RDIMX7DSABREBRD" title="Overview Page"/>
      <book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-7dual-applications-processors:RDIMX7DSABREBRD?tab=In-Depth_Tab" title="Getting Started Page"/>
      <feature type="RAM" n="1" name="1GB, DDR3 533 MHz"/>
      <feature type="MemCard" n="1" name="SD Card Holder"/>
      <feature type="ETH" n="2" m="1000000000" name="RJ45"/>
      <feature type="USB" n="1" name="USB Host connector"/>
      <feature type="USB" n="1" name="micro USB OTG connector"/>
      <feature type="Other" n="1" name="Full Mini PCIe socket"/>
      <feature type="Other" n="1" name="SIM Card slot"/>
      <feature type="CAN" n="1" name="DB9 Male Connector"/>
      <feature type="Accelerometer" n="1" name="3-axis digital Accelerometer"/>
      <feature type="Gyro" n="1" name="3-axis digital Gyroscope"/>
      <feature type="Compass" n="1" name="Digital Magnetometer"/>
      <feature type="Other" n="1" name="Barometer"/>
      <feature type="Other" n="1" name="Altimeter"/>
      <feature type="Other" n="1" name="802.11 a/b/g/n/ac WiFi"/>
      <feature type="Other" n="1" name="Bluetooth V4.0 + EDR"/>
      <feature type="ConnOther" n="1" name="Expansion port for EPDC"/>
      <feature type="ConnOther" n="1" name="Parallel LCD"/>
      <feature type="ConnOther" n="1" name="HDMI"/>
      <feature type="ConnOther" n="1" name="MIPI DSI"/>
      <feature type="ConnOther" n="1" name="MIPI CSI CMOS sensor (Camera)"/>
    </board>

    <board name="MCIMX7ULP-EVK" vendor="NXP" revision="Rev A">
      <description>Development board for iMXULP Application Processors.</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7U5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7U*"/>
      <debugInterface adapter="JTAG/SW" connector="20-Pin ARM Standard JTAG Connector (0.1 inch)"/>
    </board>

