XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC" orderForm="http://phytec.com/get-a-quote.php">
      <description>The phyBOARD-i.MX7 Zeta SBC is a two-PCB counterpart to the phyCORE-i.MX7 SOM. The SOM itself serves as the CPU core of the SBC. The SBC is formed by interfacing the SOM to a second Carrier Board PCB via high density connectors. </description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D*"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7S*"/>
      <image small="Images/IMX7-PHYBOARD-ZETA_small.jpg" large="Images/IMX7-PHYBOARD-ZETA_large.jpg"/>
      <book category="overview" name="http://phytec.com/products/single-board-computers/phyboard-i.mx7" title="Overview Page"/>
      <feature type="RAM" n="1" name="1GB DDR3"/>
      <feature type="ROM" n="1" name="4GB eMMC"/>
      <feature type="Memory" n="4096" name="EEPROM"/>
      <feature type="MemCard" n="1" name="Micro SD Card slot"/>
      <feature type="ETH" n="2" m="1000000000" name="RJ45"/>
      <feature type="USB" n="1" name="USB Host Standard-A connector"/>
      <feature type="USB" n="1" name="USB-OTG Micro-AB connector"/>
      <feature type="CAN" n="1" name="2x5 header"/>
      <feature type="LED" n="1" name="User LED"/>
      <feature type="RS232" n="1" name="2x5 header"/>
      <feature type="Other" n="1" name="Mini PCIe socket"/>
      <feature type="Other" n="1" name="RTC"/>
      <feature type="I2C" n="2" name="Expansion Bus - I2C"/>
      <feature type="AIO" n="4" name="Expansion Bus - ADC"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - USB 2.0 Host HSIC"/>
      <feature type="ConnOther" n="5" name="Expansion Bus - UART"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - CAN"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - SDIO/SD/MMC"/>
      <feature type="ConnOther" n="2" name="Expansion Bus - eCSPI"/>
      <feature type="ConnOther" n="3" name="Expansion Bus - Tamper"/>
      <feature type="ConnOther" n="2" name="Expansion Bus - PWM"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - GPIO"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - 3x3 Keypad"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - MIPI CSI"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - MIPI DSI"/>
      <feature type="ConnOther" n="1" name="Expansion Bus - JTAG"/>
      <feature type="ConnOther" n="1" name="HDMI - requires PEB-AV-01 adapter"/>
      <feature type="ConnOther" n="1" name="Display and Touch - requires PEB-AV-02 adapter"/>
      <feature type="CustomFF"  n="100" m="72"/>
    </board>

    <board name="Colibri-iMX7" vendor="Toradex" orderForm="https://www.toradex.com/order-now/computer-on-module/nxp-freescale-imx-7">
      <description>The Colibri iMX7 comprehends a Carrier Board and a System on Module with NXP/Freescale i.MX 7Dual Cortex-A7 (alternately i.MX 7Solo) and Cortex-M4 </description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D*"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7S*"/>
      <image small="Images/colibri_iMX7_small.png" large="Images/colibri_iMX7_large.png"/>
      <debugInterface adapter="JTAG/SW" connector="20-Pin Arm Standard JTAG Connector (0.1 inch)"/>
      <book category="overview" name="http://developer.toradex.com/products/colibri-imx7" title="Overview Page"/>
      <feature type="RAM" n="1" name="512MB DDR3"/>
      <feature type="ROM" n="1" name="512MB NAND Flash"/>
      <feature type="MemCard" n="1" name="Micro SD Card slot"/>
      <feature type="ETH" n="1" m="1000000000" name="RJ45"/>
      <feature type="USB" n="4" name="USB Host Standard-A connector"/>
      <feature type="USB" n="1" name="USB Device Standard-B connector"/>
      <feature type="USB" n="1" name="USB-OTG Standard-B connector"/>
      <feature type="LED" n="4" name="User LED"/>
      <feature type="RS232" n="2"/>
      <feature type="RS485" n="1"/>
      <feature type="CAN" n="1"/>
      <feature type="I2C" n="4"/>
      <feature type="SPI" n="4"/>
      <feature type="AIO" n="4"/>
      <feature type="LineIn" n="1" name="Analog Audio Line in"/>
      <feature type="LineIn" n="1" name="Analog Audio Mic in"/>
      <feature type="LineOut" n="1" name="Analog Audio Headphone out"/>
      <feature type="Other" n="1" name="RTC"/>
      <feature type="ConnOther" n="1" name="Resistive Touch"/>
      <feature type="ConnOther" n="1" name="LVDS"/>
      <feature type="ConnOther" n="1" name="HDMI"/>
      <feature type="ConnOther" n="1" name="VGA"/>
      <feature type="ConnOther" n="1" name="RGB 24/18 Bit"/>
    </board>
    
    <board name="iMX7-Dual-COM" vendor="Embedded Artists" orderForm="http://embeddedartists.com/products/kits/imx7dual_kit.php">
      <description>The iMX7 Dual COM Developer's Kit contains the iMX7 Dual COM Board, the COM Adapter Board and the COM Carrier Board. </description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D*"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7S*"/>
      <image small="Images/iMX7DualCOM_small.jpg" large="Images/iMX7DualCOM_large.jpg"/>      
      <book category="overview" name="http://embeddedartists.com/products/kits/imx7dual_kit.php" title="Overview Page"/>
      <feature type="RAM" n="1" name="1GB DDR3"/>
      <feature type="ROM" n="1" name="4GB eMMC"/>
      <feature type="MemCard" n="1" name="Micro SD Card slot"/>
      <feature type="ETH" n="2" m="1000000000" name="RJ45"/>
      <feature type="USB" n="2" name="USB Host Standard-A connector"/>
      <feature type="USB" n="1" name="USB-OTG Micro-AB connector"/>
      <feature type="CAN" n="2"/>
      <feature type="I2C" n="4"/>
      <feature type="SPI" n="4"/>
      <feature type="AIO" n="2"/>
      <feature type="LineOut" n="1" name="Analog Audio Line out"/>
      <feature type="Other" n="1" name="Mini PCIe socket"/>
      <feature type="Other" n="1" name="RTC"/>     
      <feature type="ConnOther" n="1" name="LVDS"/>
      <feature type="ConnOther" n="1" name="Parallel 24-bit RGB display interface"/>
      <feature type="ConnOther" n="3" name="UART FTDI compatible connector"/>
      <feature type="ConnOther" n="1" name="XBee compatible interface connector"/>
      <feature type="ConnOther" n="1" name="FPC connector for camera interface"/>
      <feature type="ConnOther" n="1" name="FPC connector for JTAG adapter"/>
      <feature type="CustomFF"  n="165" m="104"/>
    </board>

    <board name="iMX7-Meerkat-96Boards" vendor="Novtech" orderForm="http://www.novtech.com/">
      <description>The Meerkat board is based on the 96Boards specification</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7D*"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX7S*"/>
      <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch)"/>
      <book category="overview" name="http://www.novtech.com/" title="Overview Page"/>
      <feature type="RAM" n="1" name="512MB, DDR3 533 MHz"/>
      <feature type="MemCard" n="1" name="Micro SD Card slot"/>
      <feature type="USB" n="2" name="USB Host Standard-A connector"/>
      <feature type="USB" n="1" name="micro USB OTG connector"/>
      <feature type="Other" n="1" name="WiFi"/>
      <feature type="Other" n="1" name="Bluetooth"/>
    </board>
  
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_M4">
      <description>CMSIS-RTOS RTX Blinky example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="uv"  load="MDK/Blinky_M4.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  
    <example name="CMSIS-RTOS2 Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_M4_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS2 Blinky M4 AC6" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_M4_RTX5_AC6">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4 and ArmCC6</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

