XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <example name="CMSIS-RTOS2 Blinky A7" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_A7_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-A7</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS2 Blinky A7 AC6" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_A7_RTX5_AC6">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-A7 and ArmCC6</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    
    <example name="RPMSG PingPong BM" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_PingPong_BM_M4">
      <description>Bare-Metal RPMSG PingPong example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="uv"  load="MDK/RPMSG_PingPong_BM.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="RPMSG PingPong RTX" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_PingPong_RTX_M4">
      <description>CMSIS-RTOS RTX RPMSG PingPong example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="uv"  load="MDK/RPMSG_PingPong_RTX.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="RPMSG TTY CMSIS-RTOS" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_TTY_CMSIS-RTOS_M4">
      <description>CMSIS-RTOS RTX TTY example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="RPMSG-Lite CMSIS-RTOS" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG-Lite_CMSIS-RTOS_M4">
      <description>CMSIS-RTOS RTX example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="RPMsg-Lite"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="RPMSG-Lite CMSIS-RTOS2" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG-Lite_CMSIS-RTOS2_M4">
      <description>CMSIS-RTOS2 RTX5 example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="RPMsg-Lite"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="RPMSG TTY CMSIS-RTOS2" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_TTY_CMSIS-RTOS2_M4">
      <description>CMSIS-RTOS2 RTX5 TTY example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="Frequency Bin" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Frequency_Bin_M4">
      <description>CMSIS-RTOS RTX, CMSIS-DSP Lib, ADC and RPMSG TTY example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="Device" Cgroup="iMX7D HAL" Csub="ADC"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Linux Application TTY" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Linux_Application_TTY">
      <description>Linux Application TTY example</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky M4" doc="DS-MDK/Abstract.txt" folder="Boards/NXP/MCIMX7ULP-EVK/Blinky_M4">
      <description>CMSIS-RTOS RTX Blinky example for Cortex-M4</description>
      <board name="MCIMX7ULP-EVK" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

