XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <example name="CMSIS-RTOS2 Blinky M4" doc="DS-MDK/Abstract.txt" folder="Boards/NXP/MCIMX7ULP-EVK/Blinky_M4_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4</description>
      <board name="MCIMX7ULP-EVK" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="CMSIS-Driver USART" doc="DS-MDK/Abstract.txt" folder="Boards/NXP/MCIMX7ULP-EVK/CMSIS-Driver_USART">
      <description>CMSIS-Driver USART example for Cortex-M4</description>
      <board name="MCIMX7ULP-EVK" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="USART"/>
        <category>Getting Started</category>
        <category>CMSIS-Driver</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_M4">
      <description>CMSIS-RTOS RTX Blinky example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="uv"  load="MDK/Blinky_M4.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  
    <example name="CMSIS-RTOS2 Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Blinky_M4_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>
    
    <example name="RPMSG PingPong BM" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_PingPong_BM_M4">
      <description>Bare-Metal RPMSG PingPong example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="uv"  load="MDK/RPMSG_PingPong_BM.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    
    <example name="RPMSG PingPong RTX" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_PingPong_RTX_M4">
      <description>CMSIS-RTOS RTX RPMSG PingPong example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="uv"  load="MDK/RPMSG_PingPong_RTX.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="RPMSG TTY CMSIS-RTOS" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_TTY_CMSIS-RTOS_M4">
      <description>CMSIS-RTOS RTX TTY example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  
    <example name="RPMSG TTY CMSIS-RTOS2" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/RPMSG_TTY_CMSIS-RTOS2_M4">
      <description>CMSIS-RTOS2 RTX5 TTY example for Cortex-M4</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>
    
    <example name="Linux Application TTY" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/Linux_Application_TTY">
      <description>Linux Application TTY example</description>
      <board name="IMX7-PHYBOARD-ZETA" vendor="PHYTEC"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <category>Getting Started</category>
      </attributes>
    </example>
     
    <example name="CMSIS-RTOS Blinky M4" doc="Abstract.txt" folder="Boards/Toradex/Colibri-iMX7/Blinky_M4">
      <description>CMSIS-RTOS RTX Blinky example for Cortex-M4</description>
      <board name="Colibri-iMX7" vendor="Toradex"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  
    <example name="CMSIS-RTOS2 Blinky M4" doc="Abstract.txt" folder="Boards/Toradex/Colibri-iMX7/Blinky_M4_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4</description>
      <board name="Colibri-iMX7" vendor="Toradex"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="RPMSG PingPong BM" doc="Abstract.txt" folder="Boards/Toradex/Colibri-iMX7/RPMSG_PingPong_BM_M4">
      <description>Bare-Metal RPMSG PingPong example for Cortex-M4</description>
      <board name="Colibri-iMX7" vendor="Toradex"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="RPMSG PingPong RTX" doc="Abstract.txt" folder="Boards/Toradex/Colibri-iMX7/RPMSG_PingPong_RTX_M4">
      <description>CMSIS-RTOS RTX RPMSG PingPong example for Cortex-M4</description>
      <board name="Colibri-iMX7" vendor="Toradex"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS</category>
      </attributes>
    </example>
 
