XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX7D_DFP.pdsc
    <example name="RPMSG TTY CMSIS-RTOS2" doc="Abstract.txt" folder="Boards/Novtech/iMX7-Meerkat-96Boards/RPMSG_TTY_CMSIS-RTOS2_M4">
      <description>CMSIS-RTOS2 RTX5 TTY example for Cortex-M4</description>
     <board name="iMX7-Meerkat-96Boards" vendor="Novtech"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>
    
    <example name="UDP-TCP Socket over RPMSG" doc="Abstract.txt" folder="Boards/NXP/MCIMX7D-SABRE/UDP-TCP_Socket_over_RPMSG">
      <description>CMSIS-RTOS RTX UDP-TCP Socket over RPMSG example for Cortex-M4</description>
      <board name="MCIMX7D-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <component Cclass="Network" Cgroup="CORE" Cvariant="IPv4/IPv6 Release"/>
        <component Cclass="Network" Cgroup="Interface" Csub="ETH"/>
        <component Cclass="Network" Cgroup="Socket" Csub="TCP"/>
        <component Cclass="Network" Cgroup="Socket" Csub="UDP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
  </examples>

</package>

